EDT/УТ/src/Documents/зпНачислениеЗП/зпНачислениеЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>зпНачислениеЗП</name>
  <registerRecords>AccumulationRegister.зпНачислениеЗП</registerRecords>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>МесяцРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпСхемыРасчетаЗП</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпТарифыРасчетаЗП</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеСодержаниеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНачисленийПоЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.зпГруппыФизлиц</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НачисленияПоЗаказам</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗанятости</name>
      <type>
        <types>EnumRef.зпВидыЗанятости</types>
      </type>
    </attributes>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>DocumentRef.Рейс</types>
      </type>
    </attributes>
    <attributes>
      <name>СоставЭкипажа</name>
      <type>
        <types>EnumRef.зпСоставЭкипажа</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаборТовара</types>
        <types>DocumentRef.Фрахт</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияЗаказа</name>
      <type>
        <types>CatalogRef.зпКатегорииЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗонаДоставки</name>
      <type>
        <types>CatalogRef.зпЗоныДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплатаПоМинимальнойСтавке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>РольСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоВыходнойДень</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПримененныеМинимальныеСтавки</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>СоставЭкипажа</name>
      <type>
        <types>EnumRef.зпСоставЭкипажа</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗанятости</name>
      <type>
        <types>EnumRef.зпВидыЗанятости</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоМинимальнойСтавке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>РольСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачисленияПоЧасовойОплаты</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗанятости</name>
      <type>
        <types>EnumRef.зпВидыЗанятости</types>
      </type>
    </attributes>
    <attributes>
      <name>РольСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>DocumentRef.Рейс</types>
      </type>
    </attributes>
    <attributes>
      <name>СоставЭкипажа</name>
      <type>
        <types>EnumRef.зпСоставЭкипажа</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧасовОтработано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасовПереработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЗаСмену</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЗаЧасПереработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОтработано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПереработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИтого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачислениеПоСменам</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗанятости</name>
      <type>
        <types>EnumRef.зпВидыЗанятости</types>
      </type>
    </attributes>
    <attributes>
      <name>РольСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЗаСмену</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИтого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/зпНачислениеЗП/зпНачислениеЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>зпНачислениеЗП</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧасовОтработано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧасовПереработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СхемаРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпСхемыРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпТарифыРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.зпВидыЗанятости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Начисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоставЭкипажа</name>
    <type>
      <types>EnumRef.зпСоставЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДолжностьСотрудника</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РольСотрудника</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияЗаказа</name>
    <type>
      <types>CatalogRef.зпКатегорииЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.зпЗоныДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоМинимальнаяСтавка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/InformationRegisters/ДокументыЗакрытыеДляИзменения/ДокументыЗакрытыеДляИзменения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыЗакрытыеДляИзменения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗакрытДляРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/зпЗакрытыеРасчетныеПериоды/зпЗакрытыеРасчетныеПериоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>зпЗакрытыеРасчетныеПериоды</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПериодЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.зпРасчетЗП</types>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/зпНачислениеЗП/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//есть ли записи в данном периоде РН.зпНачислениеЗП
	Если ПроверитьДвиженияЗаПериод() Тогда
		Отказ = Истина;
		Сообщить("Документ не проведен! Движения за период уже есть!");
	КонецЕсли;
	
	//незакрыт ли документ РС.ДокументыЗакрытыеДляИзменения
	Если ПроверитьДокументНаЗакрытиеДляИзменения() Тогда
		Отказ = Истина;
		Сообщить("Документ не проведен! Документ закрыти на изменения!");
	КонецЕсли;
	
	//не закрыт ли расчетный период (по РС.зпЗакрытыеРасчетныеПериоды) 
	Если ПроверитьЗакрытРасчетныйПериод() Тогда
		Отказ = Истина;
		Сообщить("Документ не проведен! Закрыт расчетный период!");
	Конецесли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Движения.зпНачислениеЗП.Записывать = Истина;
	Движения.зпНачислениеЗП.Очистить();
	
	Для Каждого СтрокаТЧ_Нач Из НачисленияПоЗаказам Цикл
		
		//CeHbKA #4397 17.12.2020
		Если СтрокаТЧ_Нач.ОплатаПоМинимальнойСтавке Тогда
			Продолжить;
		КонецЕсли; 
		//CeHbKA #4397 17.12.2020
		
		Запись = Движения.зпНачислениеЗП.Добавить();
		Запись.Регистратор 		= Ссылка;
		Запись.Регион 			= Регион;
		Запись.СхемаРасчетаЗП 	= СхемаРасчетаЗП;
		Запись.ТарифРасчетаЗП 	= ТарифРасчетаЗП;
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТЧ_Нач);
		
	КонецЦикла;	
	
	//CeHbKA #4397 17.12.2020
	Для каждого СтрокаТЧ_Мин Из ПримененныеМинимальныеСтавки Цикл
		Запись = Движения.зпНачислениеЗП.Добавить();
		Запись.Регистратор = Ссылка;
		Запись.Регион = Регион;
		Запись.СхемаРасчетаЗП = СхемаРасчетаЗП;
		Запись.ТарифРасчетаЗП = ТарифРасчетаЗП;
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТЧ_Мин);
		Запись.Сумма = СтрокаТЧ_Мин.СуммаПоМинимальнойСтавке;
		Запись.ЭтоМинимальнаяСтавка = Истина;
	КонецЦикла; 
	//CeHbKA #4397 17.12.2020	
	
	//Геннадий #4457 01.02.2021 ->
	Для каждого СтрокаТЧ_ПоЧасам Из НачисленияПоЧасовойОплаты Цикл
		Запись = Движения.зпНачислениеЗП.Добавить();
		Запись.Регистратор 		= Ссылка;
		Запись.Регион 		  	= Регион;
		Запись.СхемаРасчетаЗП 	= СхемаРасчетаЗП;
		Запись.ТарифРасчетаЗП 	= ТарифРасчетаЗП;
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТЧ_ПоЧасам);
		Запись.ЭтоМинимальнаяСтавка = Истина;
	КонецЦикла; 
	//Геннадий 01.02.2021 <-
	
	//Геннадий #4681 30.09.2021 ->
	Для каждого СтрокаТЧ_ПоСменам Из НачислениеПоСменам Цикл
		Запись = Движения.зпНачислениеЗП.Добавить();
		Запись.Регистратор 		= Ссылка;
		Запись.Регион 		  	= Регион;
		Запись.СхемаРасчетаЗП 	= СхемаРасчетаЗП;
		Запись.ТарифРасчетаЗП 	= ТарифРасчетаЗП;
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТЧ_ПоСменам);
		Запись.Сумма = СтрокаТЧ_ПоСменам.СуммаИтого;
	КонецЦикла; 
	//Геннадий <-
	
КонецПроцедуры

Функция ПроверитьДвиженияЗаПериод() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	зпНачислениеЗП.Период КАК Период,
		|	зпНачислениеЗП.Регистратор КАК Регистратор,
		|	зпНачислениеЗП.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.зпНачислениеЗП КАК зпНачислениеЗП
		|ГДЕ
		|	зпНачислениеЗП.Период = &Период";
	
	Запрос.УстановитьПараметр("Период", НачалоМесяца(МесяцРасчета));//делать через месяц расчета
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ?(ВыборкаДетальныеЗаписи.Следующий(), Истина, Ложь);
	
КонецФункции

Функция ПроверитьДокументНаЗакрытиеДляИзменения() Экспорт//Вызывается перед записью документа
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыЗакрытыеДляИзмененияСрезПоследних.ЗакрытДляРедактирования КАК ЗакрытДляРедактирования
		|ИЗ
		|	РегистрСведений.ДокументыЗакрытыеДляИзменения.СрезПоследних(&ТекДата, Документ = &Документ) КАК ДокументыЗакрытыеДляИзмененияСрезПоследних";
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ?(ВыборкаДетальныеЗаписи.Следующий(), ВыборкаДетальныеЗаписи.ЗакрытДляРедактирования, Ложь);
	
КонецФункции

Функция ПроверитьЗакрытРасчетныйПериод()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	зпЗакрытыеРасчетныеПериодыСрезПоследних.Регион КАК Регион1,
		|	зпЗакрытыеРасчетныеПериодыСрезПоследних.РасчетныйПериод КАК РасчетныйПериод1,
		|	зпЗакрытыеРасчетныеПериодыСрезПоследних.ПериодЗакрыт КАК ПериодЗакрыт1
		|ИЗ
		|	РегистрСведений.зпЗакрытыеРасчетныеПериоды.СрезПоследних(&РасчетныйПериод, ) КАК зпЗакрытыеРасчетныеПериодыСрезПоследних
		|ГДЕ
		|	зпЗакрытыеРасчетныеПериодыСрезПоследних.Регион = &Регион
		|	И зпЗакрытыеРасчетныеПериодыСрезПоследних.РасчетныйПериод = &РасчетныйПериод
		|	И зпЗакрытыеРасчетныеПериодыСрезПоследних.ПериодЗакрыт";
	
	Запрос.УстановитьПараметр("РасчетныйПериод", НачалоМесяца(МесяцРасчета));
	Запрос.УстановитьПараметр("Регион", Регион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ?(ВыборкаДетальныеЗаписи.Следующий(), Истина, Ложь);
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПроверитьДокументНаЗакрытиеДляИзменения() Тогда
		Отказ = Истина;
		Сообщить("Документ закрыт на изменения!");
	КонецЕсли;
	
КонецПроцедуры
